https://github.com/okovtun/BV_521.git
https://www.youtube.com/playlist?list=PLeqyOOqxeiIP4IcNHD37jcaLVmXEbFd1k

IEEE-754:
http://www.softelectro.ru/ieee754.html

TODO:
0. Повторяем теорию по операторам и типам данных;
1. Написать программу, которая определяет, является ли число палиндромом.
   Число вводит пользователь с клавиатуры.
   Палиндром - это число, которое читается одинаково как слева направо, так и справа налево,
   например: 12321, 1221;
   -------------------------------------------
2. Написать программу, которая вычисляет факториал числа, введенного с клавиатуры.
   Фактроиал - это произведение ряда чисел от 0 до указанного, например:
	5! = 1*2*3*4*5;
3. Написать программу, которая возводит указанное число в указанную степень,
   основание и показатель степени вводятся с клавиатуры;
4. Вывести на экран таблицу ASCII-символов по 16 символов в строке;
5. ***Вывести на экран ряд Фибоначчи до указанного предела;
6. ***Вывести на экран заданное количество чисел из ряда Фибоначчи;

DONE:
0. Повторяем теорию по операторам и типам данных;
1. Написать программу "Calc", которая вычисляет простейшие арифметические выражения,
   например: 2+3
   Выражение вводит пользователь с клавиатуры.
2. *** Написать программу, которая определяет, является ли число палиндромом.
   Число вводит пользователь с клавиатуры.
   Палиндром - это число, которое читается одинаково как слева направо, так и справа налево,
   например: 12321, 1221

TODO:
0. Выучить теорию;
	Следующие задачи необходимо решить без компилятора;
1. 
	int i = 3;
	i = ++i + ++i;
	cout << i << endl;	//???

2. 
	int i = 3;
	i = i++ + ++i;
	cout << i << endl;	//???

3. 
	int i = 3;
	i = i++ + 1 + ++i * 2;
	cout << i << endl;	//???

4. 
	int i = 3;
	i = i++ + 1 + ++i *= 2;
	cout << i << endl;	//???

5. 
	int i = 3;
	i += i++ + 1 + ++i *= 2;
	cout << i << endl;	//???

6. 
	int i = 3;
	i *= i++ + 1 + ++i += 2;
	cout << i << endl;	//???





DONE:
1. В отдельном проекте решить все задачи из файла:
	https://github.com/okovtun/BV_521/blob/master/VariablesTask.pdf

DONE:
1. Используя оператор sizeof() и макроопределения Visual Studio вывети на экран
   информацию о следующих типах: short, long, long long, float, double;

DONE:
2. Создать проект Elochka, и в нем вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли, и его куплеты должны быть 
   раздерены пустыми строками.
   В журнал прислать файл 'main.cpp';